// Задание 2 такой ватиант лучше нижнего?
// как по мне, нижний более читаем (но это наверное для новичка!)

// const result = (a) => {
//   let reultConditions = (typeof a !== 'number' || a < 1 ) ? 'Введите натуральное число':
//   (a >= 1001) ? ('Введено большое значение') : "Ок. Значение от 1 до 1000";
//   console.log (reultConditions);
// }
// result(1001);

// Задание 2  вариант 2

// const result = (a) => {
//   if (typeof a !== 'number' || a < 1 ){
//   console.log ('Введите натуральное число');
//   } else if (a >= 1001){
//     console.log ('Введено большое значение');
//   } else {
// console.log ("Ок. Значение от 1 до 1000");
//   }
// }
// result(null);